{
  "day": 6,
  "title": "How do you know what's real when misinformation is everywhere?",
  "teaser": "AI deepfakes. Conspiracy theories. Your feed is a weapon. Where's the solid ground?",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE FLOOD OF LIES",
      "type": "text",
      "content": "AI deepfakes are everywhere. You can't tell what's real anymore.\n\nMisinformation and disinformation ranked #2 on the World Economic Forum's global risk list. Ahead of climate change. Ahead of economic collapse.\n\nYour uncle believes QAnon. Your coworker shares conspiracy theories. Your feed is engineered for virality, not truth.\n\nPolitical polarization creates competing realities—Red truth, Blue truth, no shared truth.\n\nYou're exhausted from fact-checking everything. From second-guessing every headline. From wondering if the video you just watched was even real.\n\nHow do you know what's true anymore?",
      "wordCount": 95
    },
    {
      "number": 3,
      "heading": "THE MYTH OF \"DOING YOUR OWN RESEARCH\"",
      "type": "text",
      "content": "You thought if you just read enough articles, watched enough videos, followed enough experts—you'd find truth.\n\nSo you scroll. You research. You compare sources. You join forums, read Substacks, listen to podcasts.\n\nBut the more you search, the more confused you become.\n\nBecause **the algorithm doesn't care about truth. It cares about engagement.**\n\nAnd \"doing your own research\" in a misinformation flood isn't discernment. It's drowning.\n\nYou can't think your way to solid ground when the very information you're standing on is quicksand.",
      "wordCount": 91
    },
    {
      "number": 4,
      "heading": "THE COST OF LIQUID REALITY",
      "type": "text-with-image",
      "content": "The cost of living in liquid reality is this: **you stop trusting anything.**\n\nYou don't trust the news. You don't trust scientists. You don't trust institutions, experts, or even your own perceptions.\n\nReality becomes whatever your tribe says it is. Truth becomes tribal.\n\nYou're so busy defending your version of reality that you've forgotten what it feels like to stand on something unshakeable.\n\nAnd the exhaustion is crushing.\n\nBecause **when everything is contested, nothing is certain.**\n\nWhen truth is just another opinion, how do you live?",
      "illustration": {
        "description": "Dithered ink drawing of person standing in water/flood with fragmented reflections OR multiple mirrors showing different versions of same person",
        "file": "day-6-illustration.png"
      },
      "wordCount": 103
    },
    {
      "number": 5,
      "heading": "\"WHAT IS TRUTH?\"",
      "type": "text",
      "content": "2,000 years ago, a man stood trial.\n\nThe Roman governor, Pilate, asked him:\n\n**\"What is truth?\"**\n\nIt's the most modern question in the ancient world.\n\nPilate was cynical. Exhausted by competing claims. Drowning in political narratives.\n\nAnd the man on trial—Jesus of Nazareth—had already answered:\n\n**\"I am the way, the truth, and the life.\"**\n\nNot *a* truth among many. Not truth as information.\n\nTruth as a **person**. Truth you can know. Truth that stands when everything else shifts.",
      "wordCount": 86
    },
    {
      "number": 6,
      "heading": "GROUNDED IN THE ONE WHO DOESN'T LIE",
      "type": "text",
      "content": "Jesus said:\n\n**\"You will know the truth, and the truth will set you free.\"**\n\nNot \"you'll find truth by scrolling.\" Not \"truth is whatever you believe.\"\n\n**You will KNOW the truth.**\n\nKnow. Personally. Relationally.\n\nIn a world where AI generates lies and algorithms weaponize information, truth isn't something you research.\n\nIt's Someone you encounter.\n\nAnd when you're rooted in the One who said **\"I am the truth\"**—not in news cycles, not in tribal narratives—you have solid ground.\n\nBecause God doesn't lie. God doesn't shift. God doesn't generate deepfakes.",
      "wordCount": 96
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI'm drowning in lies.\n\nI don't know what's real anymore. I don't know who to trust. I'm exhausted from fact-checking everything and still feeling lost.\n\nI need solid ground.\n\nYou said You are the truth. Not information—a person.\n\nTeach me what it means to know You. Not just know about You.\n\nRoot me in what doesn't shift.\n\nAmen.",
      "wordCount": 65
    }
  ],
  "totalWords": 536,
  "jesusIntroduced": 5,
  "scriptureReference": "John 8:32, John 14:6, John 18:37-38"
}
