{
  "day": 3,
  "title": "Who are your people when systems fail?",
  "teaser": "Democracy feels fragile. Safety nets are being cut. Who will you call when crises hit?",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "WHEN THE NETS BREAK",
      "type": "text",
      "content": "SNAP benefits are being cut. 4 million people will lose food assistance.\n\nThe "One Big Beautiful Bill Act" just passed. Housing subsidies reduced. Mental health funding slashed.\n\nDemocracy feels fragile—71% of Californians are dissatisfied with it. Political violence at 1970s levels. National Guard troops deployed to cities.\n\nThe institutions you thought would catch you are fraying.\n\nYour therapist can't fix systemic failure. Your 401(k) can't buy community. Your government can't guarantee safety.\n\nSo when the safety nets break, who's left standing with you?",
      "wordCount": 96
    },
    {
      "number": 3,
      "heading": "THE ILLUSION OF CONNECTION",
      "type": "text",
      "content": "You have people, right?\n\nYou have coworkers you grab coffee with. A gym buddy. A book club. 847 Instagram followers.\n\nBut here's the test: **Who knows what keeps you up at 3 AM?**\n\n29% of people aged 30-44 are \"frequently or always\" lonely. That's not a failure. That's an epidemic.\n\nYou're surrounded by voices—notifications, headlines, small talk—but who knows the specific shape of your fear?\n\nWho would you call if you lost your job tomorrow?\n\nWho would bring you soup?",
      "wordCount": 89
    },
    {
      "number": 4,
      "heading": "THE COST OF TRANSACTIONAL COMMUNITY",
      "type": "text-with-image",
      "content": "The cost of transactional community is this: **when you can't perform, you disappear.**\n\nYour run club doesn't know you're depressed. Your happy hour friends don't know your marriage is failing. Your networking group doesn't know you're one paycheck from eviction.\n\nBecause those aren't communities. They're activity-based gatherings.\n\nWhen the activity stops—injury, layoff, burnout—do they still show up?\n\nCommunity built on what you DO collapses when you can't DO anymore.\n\nYou need people who know you when you're not performing.\n\nThe question is: do you have them?",
      "illustration": {
        "description": "Dithered ink drawing of crowd of people but one person isolated/alone in the middle OR hands reaching but not touching",
        "file": "day-3-illustration.png"
      },
      "wordCount": 103
    },
    {
      "number": 5,
      "heading": "AN ANCIENT COMMUNITY IN CRISIS",
      "type": "text",
      "content": "2,000 years ago, a group of people faced systemic collapse.\n\nRoman occupation. Political violence. Economic exploitation. Government persecution.\n\nThe safety nets were gone.\n\nSo they built something else. Not a networking group. Not an activity club.\n\nThe text says:\n\n**\"All the believers were together and had everything in common. They sold property and possessions to give to anyone who had need.\"**\n\nNot charity. **Mutual aid.**\n\nNot transactions. **Covenant.**",
      "wordCount": 87
    },
    {
      "number": 6,
      "heading": "THE KINGDOM ECONOMICS OF SHOWING UP",
      "type": "text",
      "content": "This wasn't socialism. This wasn't naive idealism.\n\nThis was **kingdom economics**: when institutions fail, God's people become the safety net for each other.\n\nThey didn't wait for the government to fix it. They shared what they had.\n\nWhen one person lost their income, the community provided. When someone was sick, the community showed up. When systems collapsed, **the people of God were still standing.**\n\nNot because they were rich or powerful.\n\nBecause they knew: **true community isn't built on what you do. It's built on whose you are.**",
      "wordCount": 94
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been surrounded by people but still alone.\n\nI've built networks, not community. Transactions, not covenant.\n\nWhen the systems fail—and they are failing—I don't know who my people are.\n\nTeach me what it means to belong. Not to a group, but to You. And through You, to each other.\n\nHelp me find the ones who would bring soup.\n\nAmen.",
      "wordCount": 65
    }
  ],
  "totalWords": 534,
  "jesusIntroduced": 5,
  "scriptureReference": "Acts 2:44-45"
}
