{
  "day": 4,
  "title": "What if the kingdom you're looking for is already here?",
  "teaser": "You're seeking safety, provision, belonging in failing systems. What if you're looking in the wrong places?",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "WHERE YOU'VE BEEN LOOKING",
      "type": "text",
      "content": "You've been looking for refuge.\n\nIn politics—hoping the right leader will fix everything. In economics—trying to earn enough to feel secure. In nationalism—clutching at an identity that's fracturing.\n\nYou voted, donated, argued online. You optimized your finances, stockpiled savings, planned for every contingency. You wrapped yourself in flags and talking points.\n\nAnd still, nothing holds.\n\nThe governments are unstable. The markets are volatile. The national identity is splitting at the seams.\n\nYou've been looking for a kingdom that won't collapse.\n\nBut you've been looking in empires.",
      "wordCount": 94
    },
    {
      "number": 3,
      "heading": "THE SEARCH THAT EXHAUSTS",
      "type": "text",
      "content": "You've tried spirituality too, haven't you?\n\nYoga. Meditation apps. Therapy. Astrology. Crystals. Tarot. Podcasts promising enlightenment in 20 minutes.\n\nYou curate your spiritual life like a Netflix queue. Sample a little Buddhism here, a little mindfulness there. Mix in some Indigenous wisdom, some Stoicism, some self-help.\n\nIt's spirituality as consumer goods.\n\nAnd it's left you exhausted.\n\nBecause you can't **shop** your way to transcendence.\n\nYou can't **curate** your way to peace.\n\nThe kingdom you're searching for can't be bought, optimized, or assembled from parts.",
      "wordCount": 91
    },
    {
      "number": 4,
      "heading": "THE KINGDOM THAT FINDS YOU",
      "type": "text-with-image",
      "content": "2,000 years ago, religious leaders asked Jesus:\n\n**\"When will the kingdom of God come?\"**\n\nThey wanted a timeline. A plan. Something they could control.\n\nJesus answered:\n\n**\"The kingdom of God is not coming with signs to be observed... For behold, the kingdom of God is in the midst of you.\"**\n\nNot later. **Now.**\nNot somewhere else. **Here.**\nNot something you find. **Something that finds you.**\n\nYou've been searching for the kingdom in empires and economies.\n\nMeanwhile, it's been here all along, searching for you.",
      "illustration": {
        "description": "Dithered ink drawing of door with light shining through cracks OR person turning around to see something behind them",
        "file": "day-4-illustration.png"
      },
      "wordCount": 97
    },
    {
      "number": 5,
      "heading": "SEEK FIRST",
      "type": "text",
      "content": "In another teaching, Jesus said this:\n\n**\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nAll these things—food, clothing, provision, security, peace, community.\n\nThe things you've been frantically chasing in politics, economics, and consumer spirituality.\n\nJesus says: **Stop.**\n\nSeek the kingdom first. Not as one option among many. Not as a spiritual product to consume.\n\n**First.** Before empire. Before markets. Before curated spirituality.\n\nAnd when you do, everything else you've been grasping for gets added—not because you earned it, but because you're finally looking in the right place.",
      "wordCount": 92
    },
    {
      "number": 6,
      "heading": "ENTERING THE KINGDOM",
      "type": "text",
      "content": "The kingdom of God isn't a place you escape to. It's a reality you enter now.\n\nIt doesn't depend on who's president. It doesn't collapse when markets crash. It doesn't require your nationality or your bank account.\n\nIt's the community that shares food when SNAP gets cut.\nIt's the peace that exists even in political chaos.\nIt's the identity that remains when your labels fail.\n\n**The kingdom is mutual aid, not capitalism.**\n**It's covenant community, not transactional networks.**\n**It's God-given identity, not performance.**\n\nYou've been looking for this in the wrong kingdoms.\n\nWhat if you stopped searching and let it find you?",
      "wordCount": 102
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been looking for refuge in empires.\n\nI've been seeking security in economies.\n\nI've been shopping for spirituality like it's a product I can curate.\n\nI'm tired.\n\nYour kingdom has been here all along, and I've been running past it.\n\nTeach me to stop searching and start surrendering.\n\nTo seek You first.\n\nTo let Your kingdom find me.\n\nAmen.",
      "wordCount": 65
    }
  ],
  "totalWords": 541,
  "jesusIntroduced": 4,
  "scriptureReference": "Matthew 6:33, Luke 17:20-21"
}
