{
  "day": 5,
  "title": "What if provision isn't about having enough, but sharing what you have?",
  "teaser": "Grocery bills are crushing you. 47.9 million food insecure. What's kingdom economics look like now?",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE BILLS KEEP COMING",
      "type": "text",
      "content": "Grocery bills are up 25% since 2020. Rent takes half your income—maybe more.\n\n47.9 million people are food insecure. 1 in 7 households don't know where their next meal is coming from.\n\nThe \"One Big Beautiful Bill Act\" just cut SNAP benefits. 4 million people losing assistance.\n\nTariffs are adding $1,300 to $1,600 per household in food costs alone.\n\nYou're doing the math every week: rent or groceries. Gas or utilities. Medicine or food.\n\nThe bills keep coming.\n\nAnd you're one paycheck, one medical emergency, one layoff away from joining the 47.9 million.",
      "wordCount": 98
    },
    {
      "number": 3,
      "heading": "THE MYTH OF ACCUMULATION",
      "type": "text",
      "content": "You thought if you just earned enough, saved enough, stockpiled enough—you'd finally feel secure.\n\nSo you hoard. Extra canned goods. Emergency fund. Side hustles. Backup plans for your backup plans.\n\nBut here's the truth: **There's no amount of accumulation that kills the fear.**\n\nBecause the goal keeps moving. Enough becomes more. Security becomes control. Provision becomes hoarding.\n\nAnd while you're stockpiling, your neighbor is starving.\n\nThe myth is this: **abundance is about having enough.**\n\nBut what if it's about opening your hands?",
      "wordCount": 87
    },
    {
      "number": 4,
      "heading": "THE COST OF THE CLOSED FIST",
      "type": "text-with-image",
      "content": "The cost of hoarding is this: **you're always afraid you'll lose it.**\n\nYou can't enjoy what you have because you're terrified it won't be enough. You can't help your neighbor because you might need it later. You can't give because giving means less for you.\n\nYour fist is clenched so tight, nothing can get in—but nothing can get out either.\n\nYou've made provision an idol. And idols always demand more.\n\nMeanwhile, 31.3% of households are cost-burdened by housing. 10.4 million renters spend half their income on shelter.\n\nThe system is broken.\n\nThe question is: what do God's people do when systems fail?",
      "illustration": {
        "description": "Dithered ink drawing of open hand with seeds/coins falling through OR clenched fist with nothing inside",
        "file": "day-5-illustration.png"
      },
      "wordCount": 102
    },
    {
      "number": 5,
      "heading": "WHEN RESOURCES WERE SHARED, THERE WAS ABUNDANCE",
      "type": "text",
      "content": "2,000 years ago, Jesus' followers faced a crisis.\n\n5,000 people. Wilderness. No food.\n\nThe disciples wanted to send everyone away. \"We don't have enough.\"\n\nBut a boy offered what he had: five loaves, two fish.\n\nJesus took it. Blessed it. Broke it. **Shared it.**\n\nAnd when resources were shared instead of hoarded, there was abundance.\n\nNot because more appeared out of nowhere. But because **when you open your hands, provision multiplies.**\n\n12 baskets left over.\n\nKingdom economics: sharing creates abundance. Hoarding creates scarcity.",
      "wordCount": 88
    },
    {
      "number": 6,
      "heading": "DAILY BREAD, NOT STOCKPILES",
      "type": "text",
      "content": "In the same sermon, Jesus said:\n\n**\"Do not worry about your life, what you will eat or drink... But seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nNot \"accumulate enough to feel safe.\"\n\n**Seek the kingdom. Share what you have. Trust for daily bread.**\n\nProvision isn't about your bank account. It's about **whose** you are and **who** your people are.\n\nWhen SNAP gets cut, do you have neighbors who share food?\n\nThat's kingdom economics.",
      "wordCount": 89
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been clenching my fist, afraid I won't have enough.\n\nI've been hoarding when my neighbor is starving.\n\nI've made security an idol and provision a fear.\n\nTeach me the economics of Your kingdom—where sharing creates abundance, and daily bread is enough.\n\nHelp me open my hands.\n\nShow me who needs what I have.\n\nLet me trust You for tomorrow.\n\nAmen.",
      "wordCount": 65
    }
  ],
  "totalWords": 529,
  "jesusIntroduced": 5,
  "scriptureReference": "Matthew 6:25-34, Mark 6:30-44"
}
