{
  "day": 2,
  "title": "What if grief is holy?",
  "teaser": "The honesty of lament. Permission to grieve. The psalmists didn't fake joy—they screamed at God and called it worship.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE SILENCING OF GRIEF",
      "type": "text",
      "content": "You've been taught that faithful people don't grieve too loudly.\n\nDon't complain. Don't question. Don't express anger at God. If you're really trusting Him, you'll be joyful.\n\nSo when the darkness comes—when the climate crisis accelerates, when democracy fractures, when your mental health collapses—you're supposed to smile and say, \"God is good.\"\n\nBut what happens when you can't?\n\nWhat happens when the grief is too big, the fear too real, the anger too sharp?\n\nYou silence it. Suppress it. Spiritualize it away.\n\nBecause surely faithful people don't feel like this.\n\nBut here's the truth: **You've been lied to about grief.**",
      "wordCount": 106
    },
    {
      "number": 3,
      "heading": "THE PSALMS OF RAGE",
      "type": "text",
      "content": "Open the Bible. Not to the happy verses. To the Psalms.\n\nHalf of them are laments. Screams. Accusations. Rage at God.\n\n**\"How long, O LORD? Will you forget me forever?\"**\n**\"My God, my God, why have you forsaken me?\"**\n**\"I am worn out from groaning; every night I drench my bed with tears.\"**\n\nThese aren't footnotes. They're Scripture. Holy text.\n\nThe psalmists didn't fake joy. They didn't spiritualize pain. They brought their rage, their grief, their terror **directly to God.**\n\nAnd God included it in the Bible.\n\nBecause lament isn't the opposite of faith. **It's the language of faith in the dark.**\n\nGrief isn't unfaithful. Denial is.",
      "wordCount": 109
    },
    {
      "number": 4,
      "heading": "PERMISSION TO GRIEVE",
      "type": "text-with-image",
      "content": "Here's what you need to hear: **You have permission to grieve.**\n\nThe state of the world. The fracturing of democracy. The climate crisis. Your own mental health. Your lost dreams.\n\nYou don't have to pretend it's fine. You don't have to smile through the pain. You don't have to spiritualize away the terror.\n\n**Grief is holy.**\n\nIt's the honest acknowledgment that something is broken. That the world isn't what it should be. That the darkness is real.\n\nAnd when you bring that grief to God—not in polite whispers but in raw honesty—you're not being unfaithful.\n\nYou're doing what the psalmists did. What the prophets did. What God's people have done for millennia.\n\nYou're lamenting. And lament is a form of prayer.",
      "illustration": {
        "description": "Dithered image of person kneeling in grief, or hands raised in lament, or tears falling",
        "file": "hope-day-2-illustration.png"
      },
      "wordCount": 122
    },
    {
      "number": 5,
      "heading": "THE PATTERN OF LAMENT",
      "type": "text",
      "content": "Biblical lament follows a pattern:\n\n**1. Address God directly**—\"O LORD, how long?\"\n**2. Complain honestly**—\"Everything is falling apart.\"\n**3. Ask for help**—\"Save me from this darkness.\"\n**4. Trust anyway**—\"But I will hope in You.\"\n\nIt's not toxic positivity. It's not denial. It's **holding grief and hope together.**\n\nYou don't skip the darkness to get to the light. You bring the darkness into the light.\n\nAnd somehow, in the act of honest lament, hope begins to grow.\n\nNot because circumstances changed. But because you've stopped carrying the grief alone.\n\nYou've given it to God. And that changes everything.",
      "wordCount": 107
    },
    {
      "number": 6,
      "heading": "THE PROMISE IN THE DARK",
      "type": "text",
      "content": "God doesn't ask you to pretend the darkness isn't real.\n\nHe invites you to bring it to Him.\n\nEvery fear. Every grief. Every rage at the brokenness of the world.\n\nAnd here's the promise: **He can hold it.**\n\nYour grief won't break Him. Your anger won't offend Him. Your despair won't push Him away.\n\nBecause He's not afraid of your darkness. He entered it.\n\nAnd when you learn to lament—to bring your honest grief to God—you're not losing hope.\n\nYou're finding the kind of hope that can survive the dark.\n\nThe kind that doesn't deny pain but transforms it.\n\nThat's the hope the kingdom offers: **not the absence of grief, but the presence of God in it.**",
      "wordCount": 115
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI'm angry. I'm terrified. I'm grieving and I don't know how to hold it.\n\nI've been told faithful people don't feel like this. But the psalmists did. So maybe I'm allowed to as well.\n\nHere's my lament: The world is breaking. I'm scared about the future. I don't know how to hope when everything feels apocalyptic.\n\nI'm bringing it to You. Not politely. Honestly.\n\nTeach me to lament. To grieve faithfully. To hold darkness and hope together.\n\nI trust You can handle my grief.\n\nAmen.",
      "wordCount": 87
    }
  ],
  "totalWords": 646,
  "jesusIntroduced": null,
  "scriptureReference": "Psalm 13:1, Psalm 22:1, Psalm 6:6, Matthew 6:33",
  "chiastic_position": "B - Building/Development"
}
