{
  "day": 5,
  "title": "What if hope is a resurrection promise, not blind optimism?",
  "teaser": "Resolution: Hope as the certainty of resurrection, not the certainty of outcomes. God makes all things new—even in 2026.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE DIFFERENCE BETWEEN OPTIMISM AND HOPE",
      "type": "text",
      "content": "You started this week wondering if hope was even possible.\n\n57% pessimistic about the future. Climate crisis. Political violence. Everything feels apocalyptic.\n\nAnd you've learned this: **Optimism is dead. But hope is alive.**\n\nOptimism says, \"Things will get better.\"\nHope says, **\"God is faithful, even when things don't.\"**\n\nOptimism needs evidence. Hope trusts anyway.\nOptimism requires certainty about outcomes. Hope rests in the certainty of God's character.\n\nOptimism collapses when circumstances fail. **Hope survives because it's rooted in resurrection.**\n\nThat's the difference. And in 2026, it's the difference that matters.",
      "wordCount": 99
    },
    {
      "number": 3,
      "heading": "THE RESURRECTION PATTERN",
      "type": "text",
      "content": "The Gospel doesn't promise that bad things won't happen.\n\nIt promises that **death doesn't get the last word.**\n\nJesus didn't skip the cross. He died. Really died. Buried in a tomb. Dead for three days.\n\nThe disciples thought it was over. Hope was gone. The kingdom experiment had failed.\n\nBut on the third day, **God raised him from the dead.**\n\nNot resuscitation. Resurrection. A new kind of life that death couldn't touch.\n\nAnd that pattern—**death, burial, resurrection**—became the foundation of Christian hope.\n\nNot \"everything will be fine.\" But **\"God brings life out of death. Always.\"**\n\nEven when you can't see it. Even when it feels impossible. Even in 2026.",
      "wordCount": 107
    },
    {
      "number": 4,
      "heading": "THE PROMISE IN THE DARKNESS",
      "type": "text-with-image",
      "content": "Here's the promise that holds everything together:\n\n**\"Behold, I am making all things new.\"** (Revelation 21:5)\n\nNot \"some things.\" **All things.**\n\nThe climate crisis? God will make it new.\nThe fracturing of democracy? God will make it new.\nYour broken mental health? God will make it new.\nThe world that feels apocalyptic? **God will make it new.**\n\nThis isn't denial. It's not toxic positivity. It's **resurrection hope.**\n\nThe certainty that God's kingdom is coming. That death doesn't win. That darkness isn't final.\n\nYou don't know how it happens. You don't know when. But you know **who makes the promise.**\n\nAnd He's proven He keeps it. On a Sunday morning, two thousand years ago.",
      "illustration": {
        "description": "Dithered image of sunrise breaking through darkness, or new growth from broken ground",
        "file": "hope-day-5-illustration.png"
      },
      "wordCount": 125
    },
    {
      "number": 5,
      "heading": "THE HOPE THAT ENDURES",
      "type": "text",
      "content": "The early Christians lived in a world as dark as ours.\n\nPolitical violence. Persecution. Economic exploitation. Institutional collapse.\n\nThey had every reason to despair. But they didn't.\n\nNot because they were optimistic. But because they had **resurrection hope.**\n\nThey knew that the God who raised Jesus from the dead was making all things new. And that promise sustained them through darkness.\n\nThey didn't know how their story would end. They didn't have guarantees about outcomes.\n\nBut they knew **the ending of the whole story.** Death defeated. Darkness transformed. All things made new.\n\nAnd that hope—**the certainty of resurrection, not the certainty of outcomes**—kept them faithful.\n\nIt can keep you faithful too.",
      "wordCount": 112
    },
    {
      "number": 6,
      "heading": "THE KINGDOM ALREADY AND NOT YET",
      "type": "text",
      "content": "Jesus said, **\"Seek first the kingdom of God.\"**\n\nThe kingdom is already here—breaking in through every act of faithfulness, every prayer, every moment of presence, every choice to hope.\n\nAnd the kingdom is not yet—waiting for the day when God makes all things new, when resurrection becomes complete, when hope becomes sight.\n\n**You live in the tension between the two.**\n\nAlready experiencing glimpses of resurrection life. Not yet seeing the fullness.\n\nBut here's the truth: **Living in that tension is what faithfulness looks like.**\n\nYou don't need to see the whole picture. You just need to trust the One who does.\n\nAnd keep taking the next faithful step, knowing that every act of hope participates in God's resurrection work.\n\nThat's the kingdom. That's the hope.",
      "wordCount": 123
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI don't have optimism. But I'm choosing hope.\n\nNot because I can see how this ends. But because You've proven You bring life out of death.\n\nYou raised Jesus. You're making all things new. Even in 2026. Even in my life. Even when I can't see it.\n\nTeach me to live in the tension—already and not yet. To be faithful in the dark. To hope because of resurrection, not outcomes.\n\nI'm seeking Your kingdom first. Not certainty. Not answers. Just You.\n\nYou are my hope.\n\nAmen.",
      "wordCount": 90
    }
  ],
  "totalWords": 656,
  "jesusIntroduced": null,
  "scriptureReference": "Revelation 21:5, Matthew 6:33, 1 Corinthians 15:20-22",
  "chiastic_position": "A' - Resolution/Conclusion"
}
