{
  "day": 3,
  "title": "What if you're not what you do—you're whose you are?",
  "teaser": "The pivot: When performance fails, identity remains. You are named before you are productive.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE PERFORMANCE TRAP",
      "type": "text",
      "content": "You've spent your whole life proving yourself.\n\nProving you're smart enough to get into college. Productive enough to keep the job. Successful enough to deserve respect. Good enough to be loved.\n\nYour résumé is your identity. Your output is your worth. Your performance is your proof.\n\nBut here's the trap: **you're only as valuable as your last achievement.**\n\nGet laid off? Your identity evaporates. Burn out? You disappear. Fall behind? You're replaceable.\n\nYou're exhausted. Because the treadmill never stops.\n\nAnd the question underneath it all is: **If I stop performing, do I still matter?**",
      "wordCount": 98
    },
    {
      "number": 3,
      "heading": "THE WEIGHT OF WORTHLESSNESS",
      "type": "text",
      "content": "This is what it feels like to tie your worth to what you produce:\n\nYou can't rest. Because rest means you're not working, and not working means you're not valuable.\n\nYou can't fail. Because failure means you're not good enough, and not being good enough means you're disposable.\n\nYou can't be weak. Because weakness means you can't perform, and if you can't perform, who are you?\n\nThe weight is crushing you.\n\nBecause deep down, you know: **if your identity is what you do, one bad day can erase you.**",
      "wordCount": 93
    },
    {
      "number": 4,
      "heading": "THE BREAKING POINT",
      "type": "text-with-image",
      "content": "The cost of performance-based identity is this: **eventually, you break.**\n\nBurnout rates are skyrocketing. 52% of workers feel exhausted. You're running on fumes, terrified that if you stop, you'll lose everything.\n\nBut what if the breaking is the beginning?\n\nWhat if the collapse of performance-based identity is the moment you discover who you actually are?\n\nBecause when you can't perform anymore—when the résumé doesn't save you, when the productivity fails, when the output stops—**you're still here.**\n\nStripped bare. Exhausted. Empty-handed.\n\nAnd that's exactly where the pivot happens.",
      "illustration": {
        "description": "Dithered image of person stripped of armor/costume, or hands releasing heavy chains",
        "file": "identity-day-3-illustration.png"
      },
      "wordCount": 104
    },
    {
      "number": 5,
      "heading": "THE PIVOT — YOU ARE NAMED BEFORE YOU ARE PRODUCTIVE",
      "type": "text",
      "content": "Before Jesus began his ministry—before he taught anyone, healed anyone, performed any miracles—something happened.\n\nHe was baptized. And as he came up from the water, a voice from heaven said:\n\n**\"This is my Son, whom I love; with him I am well pleased.\"**\n\nWait. Pleased with what? He hadn't done anything yet.\n\nThat's the point.\n\n**Jesus was named and loved BEFORE he performed.**\n\nHis identity wasn't earned. It was given.\n\nAnd if that's true for Jesus, it's true for you.\n\nYou are not what you do. You are whose you are.",
      "wordCount": 99
    },
    {
      "number": 6,
      "heading": "THE KINGDOM REVERSAL",
      "type": "text",
      "content": "This is the core revelation of the kingdom:\n\n**Your worth is not performance-based. It's presence-based.**\n\nYou are loved before you achieve.\nYou are named before you produce.\nYou belong before you prove yourself.\n\nJesus says: **\"Seek first the kingdom.\"**\n\nThe kingdom isn't a place where you earn your identity through productivity. It's a place where **your identity is secure because God names you.**\n\nChild. Beloved. Known.\n\nNot because of your résumé. Because of whose you are.\n\nWhen everything that defined you is shaken—your job, your status, your achievements—this remains:\n\n**You are God's. And that doesn't collapse.**",
      "wordCount": 101
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been performing my whole life, trying to prove I'm worthy.\n\nI'm exhausted. And I'm terrified that if I stop, I'll disappear.\n\nBut You say I'm named before I'm productive. Loved before I achieve. Yours before I prove anything.\n\nTeach me to rest in that.\n\nWhen my résumé fails, when my output stops, when I can't perform—remind me: I'm still Yours.\n\nAnd that's enough.\n\nAmen.",
      "wordCount": 70
    }
  ],
  "totalWords": 565,
  "jesusIntroduced": 5,
  "scriptureReference": "Matthew 3:16-17, Matthew 6:33",
  "chiastic_position": "C - THE PIVOT (Core Revelation)"
}
