{
  "day": 4,
  "title": "How do you live from identity instead of for identity?",
  "teaser": "You know who you are now. But how do you actually live that way when the world demands proof?",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE TEMPTATION TO PROVE",
      "type": "text",
      "content": "You've heard it: You are loved before you perform. You are named before you produce.\n\nBut the world doesn't care.\n\nYour boss still wants deliverables. Your landlord still wants rent. Your followers still want content. The economy still demands productivity.\n\nSo the temptation is this: **go back to proving yourself.**\n\nBecause knowing your identity is one thing. Living from it—when bills are due, when performance reviews loom, when everyone around you is hustling—that's different.\n\nHow do you live from identity instead of for identity when the world keeps asking: **\"But what have you done lately?\"**",
      "wordCount": 98
    },
    {
      "number": 3,
      "heading": "LIVING FROM VS. LIVING FOR",
      "type": "text",
      "content": "Here's the difference:\n\n**Living FOR identity** means you work to prove you're worthy. Every task is a test. Every success is validation. Every failure is evidence you're not enough.\n\n**Living FROM identity** means you work because you're already whole. Your worth is settled. Your name is given. Your output doesn't define you—it flows from you.\n\nSame job. Same tasks. Different foundation.\n\nOne exhausts you. The other sustains you.\n\nBut how do you actually make that shift when anxiety is high and stakes feel urgent?",
      "wordCount": 90
    },
    {
      "number": 4,
      "heading": "THE PRACTICE OF REMEMBERING",
      "type": "text-with-image",
      "content": "The shift from performance to presence doesn't happen once. It happens daily.\n\nIt's a practice of **remembering.**\n\nWhen you wake up anxious about your job: **Remember—you are named before you are productive.**\n\nWhen you scroll LinkedIn comparing yourself to others: **Remember—you are loved before you achieve.**\n\nWhen you're tempted to overwork to prove your worth: **Remember—your worth is not performance-based.**\n\nThis isn't positive thinking. This is grounding yourself in truth when the world screams lies.\n\nPractical steps:\n- Start your day with scripture, not email.\n- Sabbath weekly—rest as resistance to productivity culture.\n- Name your belovedness aloud: \"I am God's. That's enough.\"",
      "illustration": {
        "description": "Dithered image of person standing on solid rock while waves crash around, or anchor holding steady in storm",
        "file": "identity-day-4-illustration.png"
      },
      "wordCount": 117
    },
    {
      "number": 5,
      "heading": "JESUS LIVED FROM, NOT FOR",
      "type": "text",
      "content": "After Jesus was named \"Beloved Son\" at his baptism, the Spirit led him into the wilderness.\n\nThe devil tempted him three times—and every temptation was about identity:\n\n**\"IF you are the Son of God, turn these stones to bread.\"**\n**\"IF you are the Son of God, throw yourself down.\"**\n\nNotice the pattern? **Prove it. Perform. Show us.**\n\nJesus didn't take the bait.\n\nHe didn't need to prove what God had already declared. His identity was settled.\n\nSo he lived **from** that identity, not **for** it.\n\nAnd that's your invitation too.",
      "wordCount": 92
    },
    {
      "number": 6,
      "heading": "KINGDOM WORK FLOWS FROM REST",
      "type": "text",
      "content": "Jesus says: **\"Seek first the kingdom.\"**\n\nNot: Prove yourself first, then rest.\n\n**Seek the kingdom first. And all these things will be added.**\n\nThe kingdom operates backwards from the world:\n- The world says work to earn. The kingdom says you're already loved.\n- The world says prove your worth. The kingdom says your worth is given.\n- The world says hustle or be left behind. The kingdom says rest, and watch God provide.\n\nWhen you live from the security of being God's, your work changes.\n\nYou're not performing for approval. You're creating from overflow.\n\nThat's kingdom work. And it doesn't burn you out.",
      "wordCount": 103
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI know You've named me. But I keep forgetting.\n\nWhen the world demands proof, I default to performance. When bills are due, I panic instead of trust.\n\nTeach me to live FROM identity, not FOR it.\n\nHelp me remember: I am Yours before I am productive. I am loved before I achieve.\n\nLet my work flow from rest, not desperation.\n\nAnchor me in the kingdom.\n\nAmen.",
      "wordCount": 68
    }
  ],
  "totalWords": 568,
  "jesusIntroduced": 5,
  "scriptureReference": "Matthew 4:1-11, Matthew 6:33",
  "chiastic_position": "B' - Application/Living It Out"
}
