{
  "day": 5,
  "title": "All these things will be added to you",
  "teaser": "Resolution: When the kingdom comes first, everything else falls into place. Not because you earned it. Because the kingdom provides.",
  "framework": "Matthew 6:33 - Seek first the kingdom of God and his righteousness, and all these things will be added to you",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE PROMISE YOU FORGOT",
      "type": "text",
      "content": "You've been so focused on the command—**\"Seek first the kingdom\"**—that you missed the promise.\n\nJesus didn't just tell you what to seek. He told you what happens when you do:\n\n**\"And all these things will be added to you.\"**\n\nAll these things. The things you've been anxiously chasing. The security you've been desperately searching for. The peace you've been trying to curate.\n\nYou've been seeking them first. And coming up empty.\n\nBut Jesus says: **When you seek the kingdom first, everything else is added.**\n\nNot earned. Not achieved. Not accumulated.\n\n**Added.** By grace. By the King who provides.",
      "wordCount": 103
    },
    {
      "number": 3,
      "heading": "THE REVERSAL OF EMPIRE LOGIC",
      "type": "text",
      "content": "This is the great reversal.\n\nThe empire says: **Seek security first, and maybe you'll find peace.**\nThe kingdom says: **Seek the kingdom first, and security is added.**\n\nThe empire says: **Seek wealth first, and maybe you'll be satisfied.**\nThe kingdom says: **Seek the kingdom first, and you'll have what you need.**\n\nThe empire says: **Seek power first, and maybe you'll be safe.**\nThe kingdom says: **Seek the kingdom first, and you'll find refuge in the King.**\n\nYou've been doing it backwards. Chasing everything except the one thing. And wondering why you're still empty.\n\nBut the kingdom inverts the logic: **When God comes first, everything else finds its proper place.**",
      "wordCount": 111
    },
    {
      "number": 4,
      "heading": "WHAT GETS ADDED",
      "type": "text-with-image",
      "content": "So what gets added when you seek first the kingdom?\n\nNot necessarily wealth. Not guaranteed political victory. Not a curated life with no suffering.\n\n**But this:**\n\nPeace in the chaos. Not because the chaos stopped, but because the King is present.\n\nProvision in uncertainty. Not because you have everything, but because you have enough.\n\nPurpose in the mess. Not because the systems are fixed, but because you're living for something that doesn't collapse.\n\nThe kingdom doesn't promise empire success. It promises **kingdom abundance.**\n\nAnd kingdom abundance looks different. It's not measured in stock portfolios or political wins. It's measured in love, joy, peace, patience, kindness, goodness, faithfulness, gentleness, self-control.\n\n**The fruit of a life rooted in the kingdom, not the empire.**",
      "illustration": {
        "description": "Dithered image of tree bearing fruit, or hands receiving/catching falling provision",
        "file": "kingdom-day-5-illustration.png"
      },
      "wordCount": 133
    },
    {
      "number": 5,
      "heading": "THE KINGDOM THAT DOESN'T COLLAPSE",
      "type": "text",
      "content": "Here's why this matters in 2026:\n\nThe empires are failing. Politics are fracturing. The economy is unstable. Consumer spirituality is empty.\n\n**But the kingdom isn't failing.**\n\nBecause the kingdom doesn't depend on elections, markets, or influencers. It depends on the King. And the King is eternal.\n\nJesus said: **\"Heaven and earth will pass away, but my words will never pass away.\"**\n\nEmpires rise and fall. Towers crumble. Systems collapse.\n\n**But the kingdom endures.**\n\nWhen you seek first the kingdom, you're not building on sand. You're building on the rock. And when the storms come—and they will—**you won't collapse with the empires.**\n\nBecause your refuge isn't in them. It's in the King.",
      "wordCount": 118
    },
    {
      "number": 6,
      "heading": "THE INVITATION TO REORDER",
      "type": "text",
      "content": "So here's the invitation:\n\n**Reorder your life around the kingdom.**\n\nStop seeking first the empire. Stop chasing security in systems that are already falling. Stop searching for refuge in politics, money, or curated spirituality.\n\n**Seek first the kingdom.**\n\nAnd watch what gets added.\n\nNot because you earned it. But because the kingdom operates on a different economy. An economy of grace. Of abundance. Of provision.\n\nThe kingdom is here. Now. In the midst of you.\n\nYou don't have to wait for it. You don't have to search for it somewhere else.\n\nYou just have to seek it first.\n\nAnd when you do, **all these things—everything you've been anxiously chasing—will be added to you.**",
      "wordCount": 117
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been seeking everything except You first.\n\nSecurity. Success. Peace. Control. I've been chasing them in empires that are already falling.\n\nForgive me. And teach me to reorder my life.\n\nI want to seek first Your kingdom. Not my comfort. Not my control. Your reign.\n\nAnd I trust the promise: that when I do, all these things—everything I actually need—will be added.\n\nNot because I earned it. But because You provide.\n\nThe kingdom is here. Help me live in it.\n\nAmen.",
      "wordCount": 86
    }
  ],
  "totalWords": 668,
  "jesusIntroduced": 2,
  "scriptureReference": "Matthew 6:33, Matthew 24:35, Galatians 5:22-23",
  "chiastic_position": "A' - Resolution: Everything else is added when kingdom comes first"
}
