{
  "day": 3,
  "title": "The kingdom of God is in the midst of you",
  "teaser": "THE PIVOT: You've been searching for a future kingdom. But Jesus said it's already here—present, accessible, now.",
  "framework": "Matthew 6:33 - Seek first the kingdom of God and his righteousness, and all these things will be added to you",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE FUTURE YOU'RE WAITING FOR",
      "type": "text",
      "content": "You've been taught to wait for the kingdom.\n\nWait for heaven. Wait for the second coming. Wait for the new earth. Wait for the future restoration when everything is finally fixed.\n\nMeanwhile, you're stuck here—in 2026, in the mess, in the chaos. In the collapsing empires and failing systems.\n\nThe kingdom is **later**. But right now? You're just surviving.\n\nSo you keep searching. For political salvation. For economic security. For spiritual products that promise peace.\n\nBecause if the kingdom is later, you need something for now.\n\nBut what if everything you've been taught about the kingdom is wrong?",
      "wordCount": 99
    },
    {
      "number": 3,
      "heading": "THE QUESTION THAT CHANGES EVERYTHING",
      "type": "text",
      "content": "2,000 years ago, religious leaders asked Jesus a question:\n\n**\"When will the kingdom of God come?\"**\n\nThey wanted a timeline. A date. A future event they could mark on their calendars.\n\nAnd Jesus gave them an answer that shattered their expectations:\n\n**\"The kingdom of God is not coming with signs to be observed, nor will they say, 'Look, here it is!' or 'There!' for behold, the kingdom of God is in the midst of you.\"**\n\nNot later. **Now.**\nNot somewhere else. **Here.**\nNot a future arrival. **A present reality.**\n\nThe kingdom isn't coming. It's already here.\n\nYou've been waiting for a future you're already standing in.",
      "wordCount": 108
    },
    {
      "number": 4,
      "heading": "THE UPSIDE-DOWN KINGDOM",
      "type": "text-with-image",
      "content": "This is why you keep missing it.\n\nThe kingdom isn't where you've been looking.\n\nIt's not in the halls of power—it's in the margins.\nIt's not in wealth accumulation—it's in radical generosity.\nIt's not in self-promotion—it's in self-emptying love.\nIt's not in control—it's in surrender.\n\nJesus didn't show up as a political revolutionary or economic reformer. He showed up as a servant. He healed the sick. He fed the hungry. He touched the untouchable. He loved the unlovable.\n\nAnd he said: **This is the kingdom.**\n\nNot Rome. Not the temple system. Not the economic order.\n\n**This.** Right here. Right now. In the ordinary moments where love interrupts empire.",
      "illustration": {
        "description": "Dithered image of hands serving/healing, or light breaking through cracks in darkness",
        "file": "kingdom-day-3-illustration.png"
      },
      "wordCount": 122
    },
    {
      "number": 5,
      "heading": "THE PIVOT — SEEK FIRST THE KINGDOM",
      "type": "text",
      "content": "This is the core of everything Jesus taught:\n\n**\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nNot seek first political victory. Not seek first financial security. Not seek first the perfect spiritual routine.\n\n**Seek first the kingdom.**\n\nAnd here's the revelation: **the kingdom isn't a place you go. It's a reality you enter.**\n\nIt's present wherever Jesus is Lord. Wherever love replaces power. Wherever generosity replaces greed. Wherever forgiveness replaces revenge. Wherever the last become first and the first become last.\n\nThe kingdom is here. Now. In the midst of you.\n\nYou don't have to wait for it. You just have to see it.",
      "wordCount": 114
    },
    {
      "number": 6,
      "heading": "ALL THESE THINGS WILL BE ADDED",
      "type": "text",
      "content": "And here's the promise:\n\nWhen you seek first the kingdom—when you stop chasing empires and start living in the present reality of God's rule—**all these things will be added to you.**\n\nNot because you earned them. Because the kingdom provides.\n\nYou don't have to anxiously chase security. The kingdom holds you.\nYou don't have to desperately search for refuge. The kingdom is your refuge.\nYou don't have to climb empires to find peace. The kingdom gives peace.\n\nThis is the reversal: When you stop seeking everything else first and seek the kingdom, **everything else falls into place.**\n\nNot later. Now.\n\nThe kingdom is here. And you're invited in.",
      "wordCount": 111
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been waiting for a kingdom that's already here.\n\nSearching for refuge in empires while standing in the midst of Your reign.\n\nForgive me for missing it. For looking past the present reality because I was chasing a future fantasy.\n\nTeach me to see the kingdom. Here. Now. In the ordinary moments where Your love interrupts my anxious search.\n\nI want to seek first Your kingdom. Not later. Not somewhere else.\n\nRight here. Right now.\n\nAmen.",
      "wordCount": 77
    }
  ],
  "totalWords": 631,
  "jesusIntroduced": 5,
  "scriptureReference": "Luke 17:20-21, Matthew 6:33",
  "chiastic_position": "C - THE PIVOT: Kingdom present vs. future, 'in the midst of you'"
}
