{
  "day": 3,
  "title": "Peace I give you—not as the world gives",
  "teaser": "The pivot: Jesus offers a peace that doesn't depend on controlling chaos. It depends on knowing the One who is sovereign over it.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE WORLD'S VERSION OF PEACE",
      "type": "text",
      "content": "The world tells you peace is a product of control.\n\nControl your environment, and you'll feel safe. Control the information, and you'll feel informed. Control the variables, and you'll feel secure.\n\nThis is peace as the world gives it: **fragile, conditional, dependent on circumstances staying stable.**\n\nBut 2026 isn't stable. Political violence. Economic anxiety. Civil unrest.\n\nSo you tighten your grip. Monitor more. Plan harder. Prepare for disaster.\n\nAnd still, no peace.\n\nBecause the peace the world offers collapses the moment circumstances shift.\n\nAnd circumstances always shift.",
      "wordCount": 91
    },
    {
      "number": 3,
      "heading": "THE BREAKING POINT",
      "type": "text",
      "content": "You've tried everything.\n\nYou've curated your news. Limited your exposure. Set boundaries. Practiced self-care.\n\nAnd yet, the anxiety remains.\n\nBecause deep down, you know: **you can't control this.** Not really.\n\nYou can't stop political violence. You can't prevent economic collapse. You can't guarantee your safety, your security, your future.\n\nThe illusion of control is cracking.\n\nAnd that's terrifying. Because if you can't control it, what do you have left?\n\nBut what if the breaking point isn't the end?\n\nWhat if it's the beginning of a different kind of peace?",
      "wordCount": 93
    },
    {
      "number": 4,
      "heading": "THE NIGHT BEFORE THE CROSS",
      "type": "text-with-image",
      "content": "Jesus knew what was coming.\n\nBetrayal. Arrest. Torture. Execution. The worst violence imaginable, only hours away.\n\nHis disciples were terrified. The world was about to collapse around them. Everything they'd hoped for—gone.\n\nAnd in that moment, Jesus said something that should have been impossible:\n\n**\"Peace I leave with you; my peace I give you. I do not give to you as the world gives. Do not let your hearts be troubled and do not be afraid.\"**\n\nWait. Peace? Now? When everything is falling apart?\n\nYes. Because the peace Jesus offers **doesn't depend on circumstances being under control.**\n\nIt depends on knowing the One who is sovereign over them.",
      "illustration": {
        "description": "Dithered image of calm waters amid storm, or hands releasing grip to open palms",
        "file": "peace-day-3-illustration.png"
      },
      "wordCount": 113
    },
    {
      "number": 5,
      "heading": "THE PIVOT — A DIFFERENT KIND OF PEACE",
      "type": "text",
      "content": "This is the pivot.\n\nThe world's peace says: Control the chaos, and you'll be okay.\n\nJesus' peace says: **I am sovereign over the chaos. You don't have to control it. I already do.**\n\nThe world's peace is fragile—dependent on stable circumstances.\n\nJesus' peace is unshakeable—dependent on an unchanging God.\n\nThe world's peace requires you to manage everything.\n\nJesus' peace requires you to surrender everything.\n\nHe doesn't promise that the chaos will stop. He promises that **in the middle of the chaos, He is with you.**\n\nAnd that changes everything.",
      "wordCount": 90
    },
    {
      "number": 6,
      "heading": "SEEK FIRST THE KINGDOM",
      "type": "text",
      "content": "Jesus said: **\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nThe kingdom is where God is sovereign. Where His peace reigns. Where your security doesn't come from controlling circumstances—it comes from trusting the King.\n\nWhen you seek the kingdom first, you stop asking, \"How do I control this?\" and start asking, \"Who is in control?\"\n\nAnd the answer is: God.\n\nNot the news cycle. Not the politicians. Not the economy.\n\nGod. Sovereign. Unchanging. Present.\n\nThat's the peace that doesn't collapse when circumstances shift.\n\nBecause it's not built on circumstances. It's built on Him.",
      "wordCount": 102
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been chasing the world's version of peace—trying to control everything, manage the chaos, prepare for disaster.\n\nAnd I'm exhausted. Anxious. Still not at peace.\n\nYou offer something different. A peace that doesn't depend on circumstances. A peace that comes from knowing You're sovereign.\n\nI don't know how to surrender. But I want to learn.\n\nTeach me to seek Your kingdom first. To trust that You hold what I can't control.\n\nGive me Your peace. The kind that doesn't collapse.\n\nAmen.",
      "wordCount": 85
    }
  ],
  "totalWords": 574,
  "jesusIntroduced": 5,
  "scriptureReference": "John 14:27, Matthew 6:33",
  "chiastic_position": "C - THE PIVOT (Core Revelation)"
}
