{
  "day": 4,
  "title": "Practicing surrender over control",
  "teaser": "What does it look like to release your grip? To seek God's peace instead of manufactured stability?",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE SHIFT FROM CONTROL TO SURRENDER",
      "type": "text",
      "content": "You've learned that peace doesn't come from controlling your circumstances. It comes from surrendering them to the One who is sovereign.\n\nBut knowing it and living it are different things.\n\nYou still wake up anxious. You still reach for your phone. You still feel the pull to doomscroll, to plan, to manage.\n\nThe old patterns don't disappear overnight.\n\nSo the question becomes: **What does surrender actually look like?**\n\nNot as an abstract concept. But as a daily practice.\n\nBecause Jesus didn't just offer peace. He offered a way to live in it.",
      "wordCount": 94
    },
    {
      "number": 3,
      "heading": "WHAT SURRENDER ISN'T",
      "type": "text",
      "content": "Surrender doesn't mean passivity.\n\nIt doesn't mean you stop working, stop planning, stop caring about the world.\n\nIt doesn't mean you ignore injustice, avoid responsibility, or pretend everything is fine.\n\nSurrender isn't apathy. It's not resignation.\n\n**Surrender is releasing the illusion that your peace depends on your ability to control outcomes.**\n\nYou still act. You still engage. You still work for good.\n\nBut you stop believing that your anxiety will somehow protect you. That your hypervigilance will prevent disaster. That your white-knuckled grip will hold everything together.\n\nYou let go of control. And you trust God with the outcomes.",
      "wordCount": 96
    },
    {
      "number": 4,
      "heading": "WHAT SURRENDER LOOKS LIKE",
      "type": "text-with-image",
      "content": "Here's what practicing surrender might look like:\n\n**You wake up anxious.** Instead of immediately scrolling, you pause. You pray. \"God, I give You this day. I can't control what happens. But You can. I trust You.\"\n\n**The news is chaotic.** Instead of obsessively monitoring it, you set limits. You stay informed without being consumed. You remember: God is sovereign over this.\n\n**You're tempted to plan for every disaster.** Instead, you ask: Am I preparing wisely, or am I trying to secure peace through control? You do what's responsible, then release the rest.\n\n**Circumstances shift.** Instead of spiraling, you breathe. You remind yourself: My peace doesn't come from stable circumstances. It comes from an unchanging God.\n\nThis is the practice. Small, repeated acts of surrender.",
      "illustration": {
        "description": "Dithered image of open hands releasing birds, or person standing calm amid swirling winds",
        "file": "peace-day-4-illustration.png"
      },
      "wordCount": 128
    },
    {
      "number": 5,
      "heading": "JESUS MODELS SURRENDER",
      "type": "text",
      "content": "Jesus practiced what he preached.\n\nThe night before the cross, in the Garden of Gethsemane, he prayed:\n\n**\"Father, if you are willing, take this cup from me; yet not my will, but yours be done.\"**\n\nHe was honest about the pain. He didn't pretend it was easy. But he surrendered.\n\nNot my will. Yours.\n\nThis is the model. Surrender isn't about suppressing your emotions or pretending you're not struggling.\n\n**Surrender is bringing your anxiety, your fear, your desire for control—and releasing it into God's hands.**\n\nNot because you don't care. But because you trust that God cares more.",
      "wordCount": 97
    },
    {
      "number": 6,
      "heading": "THE PEACE THAT COMES FROM LETTING GO",
      "type": "text",
      "content": "Here's what happens when you practice surrender:\n\nThe circumstances don't change. The world is still chaotic. 2026 is still unstable.\n\nBut something inside you shifts.\n\nYou're not carrying the weight of holding everything together anymore. You're not scanning for threats every waking moment. You're not white-knuckling your way through life.\n\nYou're resting in the knowledge that **God is sovereign, and you don't have to be.**\n\nThat's the peace Jesus promised. Not the absence of chaos. But the presence of God in the middle of it.\n\nAnd when you seek that first—when you surrender control and trust His sovereignty—everything else finds its place.",
      "wordCount": 107
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI want to surrender. But I'm still holding on.\n\nI'm still reaching for control, believing it will bring me peace.\n\nTeach me to release my grip. One moment at a time. One anxious thought at a time. One circumstance at a time.\n\nWhen I wake up anxious, remind me: You are sovereign.\n\nWhen the world feels chaotic, remind me: You hold it all.\n\nWhen I'm tempted to control everything, remind me: I can trust You with the outcomes.\n\nI surrender. Not my will, but Yours.\n\nAmen.",
      "wordCount": 88
    }
  ],
  "totalWords": 610,
  "jesusIntroduced": 5,
  "scriptureReference": "Luke 22:42, Matthew 6:33",
  "chiastic_position": "B' - Application (Echoes Day 2)"
}
