{
  "day": 5,
  "title": "Peace as a kingdom gift, not an achievement",
  "teaser": "The world is still chaotic. But you're not holding it together anymore. God is. And that changes everything.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "AFTER THE RELEASE",
      "type": "text",
      "content": "You started this week asking: What if peace isn't found by controlling your circumstances?\n\nThe world is still unstable. Political violence hasn't stopped. Civil unrest continues. 43% are still more anxious than last year.\n\nNothing around you has changed.\n\nBut something inside you has shifted: **You're not trying to control it anymore.**\n\nYou've learned that peace doesn't come from managing chaos. It comes from surrendering it to the One who is sovereign over it.\n\nYou're still here. The chaos is still here.\n\nBut your grip is looser. And that makes all the difference.",
      "wordCount": 95
    },
    {
      "number": 3,
      "heading": "WHAT YOU'VE LEARNED",
      "type": "text",
      "content": "This week, you've walked through a shift:\n\n**Day 1:** You saw the illusion—that control brings peace. It doesn't. It brings exhaustion.\n\n**Day 2:** You felt the weight—of doomscrolling, contingency planning, constant vigilance. It's unsustainable.\n\n**Day 3:** You encountered the pivot—Jesus offers a peace that doesn't depend on circumstances. It depends on Him.\n\n**Day 4:** You practiced surrender—releasing control, trusting God with outcomes, one moment at a time.\n\nAnd now, **Day 5:** You see the truth. **Peace is not an achievement. It's a gift.**\n\nYou don't earn it by managing everything perfectly. You receive it by seeking the kingdom first.",
      "wordCount": 105
    },
    {
      "number": 4,
      "heading": "PEACE AS A KINGDOM GIFT",
      "type": "text-with-image",
      "content": "The kingdom of God is where God is sovereign. Where His rule is recognized. Where His presence brings peace.\n\nAnd here's the truth: **You can't manufacture kingdom peace. You can only receive it.**\n\nThe world tells you peace is something you achieve—by controlling variables, managing risks, staying prepared.\n\nBut Jesus says peace is something you're given—by seeking God first, trusting His sovereignty, releasing your grip.\n\nYou don't have to hold everything together. God already does.\n\nYou don't have to secure your future. God already has.\n\nYou don't have to control the chaos. God is sovereign over it.\n\n**This is the kingdom gift: peace that doesn't collapse when circumstances shift.**\n\nBecause it's not built on circumstances. It's built on God.",
      "illustration": {
        "description": "Dithered image of open hands receiving light, or tree with deep roots standing firm in storm",
        "file": "peace-day-5-illustration.png"
      },
      "wordCount": 125
    },
    {
      "number": 5,
      "heading": "JESUS SENDS YOU INTO THE CHAOS",
      "type": "text",
      "content": "After his resurrection, Jesus appeared to his terrified disciples. They were hiding, anxious, uncertain.\n\nThe world was still violent. The empire was still oppressive. Nothing had stabilized.\n\nAnd Jesus said:\n\n**\"Peace be with you. As the Father has sent me, I am sending you.\"**\n\nHe didn't say, \"Wait until the world is safe.\" He didn't say, \"Control your environment first.\"\n\nHe said: **Peace be with you. Now go.**\n\nYou're not sent into stability. You're sent into chaos.\n\nBut you're sent with His peace. The kind that doesn't depend on circumstances being under control.\n\nThe kind that comes from knowing He is.",
      "wordCount": 101
    },
    {
      "number": 6,
      "heading": "SEEK FIRST THE KINGDOM",
      "type": "text",
      "content": "You started with a question: What if peace isn't found by controlling your circumstances?\n\nNow you have the answer: **It's not.**\n\nPeace is found by seeking the kingdom. By surrendering control. By trusting the One who is sovereign.\n\nJesus said: **\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nWhen you seek the kingdom first, you stop trying to manufacture peace through control. You receive it as a gift from the King.\n\nThe world is still chaotic. 2026 is still unstable.\n\nBut you're standing on something that doesn't shake.\n\nNot because you're holding it together. But because God is.",
      "wordCount": 110
    },
    {
      "number": 7,
      "heading": "THE SENDING",
      "type": "prayer",
      "content": "God,\n\nWhen I started this week, I was exhausted from trying to control everything.\n\nI've learned that peace doesn't come from managing chaos. It comes from surrendering it to You.\n\nThe world is still unstable. But I'm not holding on as tightly.\n\nI'm seeking Your kingdom first. Trusting Your sovereignty. Releasing my grip.\n\nSend me into this chaotic world with Your peace. The kind that doesn't depend on circumstances.\n\nThe kind that comes from knowing You hold all things.\n\nI'm Yours. And that's enough.\n\nAmen.",
      "wordCount": 87
    }
  ],
  "totalWords": 623,
  "jesusIntroduced": 5,
  "scriptureReference": "John 20:19-21, Matthew 6:33",
  "chiastic_position": "A' - Resolution/Sending (Echoes Day 1)"
}
