{
  "day": 3,
  "title": "What if God's economy works backwards?",
  "teaser": "The pivot: Five loaves feed 5,000. A widow's oil never runs out. Manna appears daily. In God's economy, sharing creates abundance.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE MATH DOESN'T WORK",
      "type": "text",
      "content": "5,000 people. Five loaves of bread. Two fish.\n\nThe math is brutal. You can't feed a crowd with a kid's lunch. It's not possible.\n\nThe disciples knew this. They told Jesus: **\"Send them away. We don't have enough.\"**\n\nBut Jesus didn't send them away. He took what they had—the laughably insufficient amount—and told them to distribute it.\n\nAnd it was enough. More than enough. Twelve baskets of leftovers.\n\nThe math doesn't work. Not by human logic. Not by economic principles.\n\nBut in God's economy, **sharing what you have creates what you need.**\n\nThat's the pivot you've been missing.",
      "wordCount": 102
    },
    {
      "number": 3,
      "heading": "THE WIDOW'S OIL THAT NEVER RUNS OUT",
      "type": "text",
      "content": "A widow is drowning in debt. Creditors are coming for her sons. She has nothing left but a jar of oil.\n\nThe prophet Elisha tells her: **\"Pour it out.\"**\n\nShe protests. If she pours it out, she'll have nothing. But Elisha insists: Gather empty jars from your neighbors. As many as you can. Then pour.\n\nShe pours. And pours. And pours.\n\nThe oil doesn't stop until the jars run out.\n\nIn the world's economy, using your resources depletes them. But in God's economy, **pouring out what you have multiplies it.**\n\nThe widow saved her family not by hoarding the oil, but by sharing it.",
      "wordCount": 108
    },
    {
      "number": 4,
      "heading": "THE MANNA THAT COULDN'T BE HOARDED",
      "type": "text-with-image",
      "content": "God's people are in the wilderness. No food. No reserves. Starving.\n\nSo God provides: **manna. Bread from heaven. Fresh every morning.**\n\nThe rule was simple: Gather enough for today. Don't hoard it.\n\nBut some people didn't trust. They gathered extra. Stockpiled for tomorrow. Tried to secure their future.\n\nAnd it rotted. Bred worms. Became worthless.\n\nBecause God's provision isn't designed to be accumulated. **It's designed to be received daily and shared freely.**\n\nThe people who hoarded had nothing. The people who trusted had enough.\n\nThat's the pattern: **In God's economy, hoarding kills. Sharing sustains.**",
      "illustration": {
        "description": "Dithered image of bread multiplying in baskets, or oil overflowing from small jar",
        "file": "provision-day-3-illustration.png"
      },
      "wordCount": 115
    },
    {
      "number": 5,
      "heading": "THE PIVOT — GOD'S ECONOMY OF ABUNDANCE",
      "type": "text",
      "content": "Every story points to the same truth: **God's economy works backwards.**\n\nIn the world's economy, you hoard to have enough. In God's economy, you share to create abundance.\n\nIn the world's economy, scarcity is the baseline. In God's economy, abundance flows when people open their hands.\n\nJesus demonstrated this over and over. Five loaves feed thousands. A few fish become a feast. Water becomes wine at a wedding.\n\nAnd he says to you now: **\"Give, and it will be given to you... pressed down, shaken together, running over.\"**\n\nNot because hoarding works. But because **sharing unlocks what God has already provided.**\n\nThat's the pivot. Stop clenching. Start sharing.",
      "wordCount": 113
    },
    {
      "number": 6,
      "heading": "SEEK FIRST THE KINGDOM",
      "type": "text",
      "content": "Jesus cuts through the anxiety with one statement:\n\n**\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nWhat things? Food. Clothing. Provision. The basics you're hoarding out of fear.\n\nBut the order matters: **Seek the kingdom first. Then provision follows.**\n\nWhat does seeking the kingdom look like? Sharing your loaves. Pouring out your oil. Gathering only what you need today and trusting for tomorrow.\n\nIt's the opposite of accumulation. It's the practice of open-handed generosity.\n\nBecause in God's economy, **the way you receive provision is by giving it away.**\n\nThat's not reckless. That's faith.",
      "wordCount": 105
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI've been operating in the world's economy. Hoarding to feel secure. Accumulating to feel safe.\n\nBut You're showing me a different way. A backwards way.\n\nFive loaves feed thousands. A widow's oil never runs out. Manna appears daily.\n\nIn Your economy, sharing creates abundance. Pouring out multiplies provision. Open hands receive more than clenched fists.\n\nI want to live in that economy. I want to trust that when I share what I have, You'll provide what I need.\n\nTeach me to seek Your kingdom first. To give freely. To stop hoarding and start trusting.\n\nThe math doesn't work. But You do.\n\nAmen.",
      "wordCount": 106
    }
  ],
  "totalWords": 649,
  "jesusIntroduced": 5,
  "scriptureReference": "Matthew 14:13-21, 2 Kings 4:1-7, Exodus 16, Luke 6:38, Matthew 6:33",
  "chiastic_position": "C - THE PIVOT (Core Revelation)"
}
