{
  "day": 5,
  "title": "What if sharing is how needs get met?",
  "teaser": "You started hoarding out of fear. But you're ending with open hands. When you share what you have, everyone has enough.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "AFTER THE SHIFT",
      "type": "text",
      "content": "You started this week with a full pantry and an empty heart.\n\nStockpiled. Afraid. Convinced there would never be enough.\n\n47.9 million Americans are still food insecure. The economy is still unstable. The systems are still failing.\n\nThe circumstances haven't changed.\n\nBut something in you has.\n\nYou're not clenching anymore. You're not hoarding out of fear. You're not enslaved to the scarcity mindset.\n\nBecause you've seen a different way: **Provision flows through sharing, not hoarding.**\n\nAnd you're ready to live in that economy now.",
      "wordCount": 89
    },
    {
      "number": 3,
      "heading": "WHAT SURVIVES THE COLLAPSE",
      "type": "text",
      "content": "When the economy crashes, what survives?\n\nNot your stockpile. Not your savings account. Not your carefully calculated reserves.\n\nWhat survives is **the community that shares.**\n\nThe people who pooled rent when someone lost their job. The neighbors who created shared pantries. The church that practiced mutual aid instead of charity.\n\nWhen systems fail, institutions collapse, and fear drives others into isolation, **the people who share resources are the ones who make it through.**\n\nBecause God's economy doesn't depend on empire being stable. It depends on people being faithful.\n\nAnd faithfulness looks like open hands, shared tables, and trust that there's enough when we stop hoarding.",
      "wordCount": 109
    },
    {
      "number": 4,
      "heading": "WHAT YOU CARRY FORWARD",
      "type": "text-with-image",
      "content": "You'll still live in 2026. You'll still face economic anxiety. You'll still see scarcity and collapse around you.\n\nBut you'll carry something different: **The knowledge that sharing creates abundance.**\n\nWhen your neighbor loses their job, you'll share rent. When your friend can't afford groceries, you'll stock a community pantry. When the systems fail, you'll create mutual aid networks.\n\nNot because you're rich. Not because you have it all figured out. But because you've learned: **Your abundance is meant to circulate, not accumulate.**\n\nThat's the kingdom economy. It doesn't hoard. It shares.\n\nAnd when everyone shares, **everyone has enough.**",
      "illustration": {
        "description": "Dithered image of hands releasing resources like water flowing, or circle of people passing bread",
        "file": "provision-day-5-illustration.png"
      },
      "wordCount": 116
    },
    {
      "number": 5,
      "heading": "JESUS SENDS YOU OUT WITH OPEN HANDS",
      "type": "text",
      "content": "When Jesus sent his disciples out, he gave them strange instructions:\n\n**\"Take no gold, no silver, no copper... no bag, no extra tunic, no sandals.\"**\n\nGo with nothing. Trust that what you need will be provided.\n\nIt sounds reckless. Until you realize: **Jesus was teaching them to live in the kingdom economy.**\n\nNot the empire's economy of accumulation and fear. But God's economy of trust and sharing.\n\nYou receive from the community. The community receives from you. Provision flows. Needs are met.\n\nNot because you hoarded. But because you **trusted enough to share.**\n\nJesus sends you out the same way now: **Go with open hands. Share what you have. Trust that it's enough.**",
      "wordCount": 114
    },
    {
      "number": 6,
      "heading": "SEEK FIRST THE KINGDOM — AND SHARE",
      "type": "text",
      "content": "You end where you began: **\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nBut now you understand what it means.\n\nSeeking the kingdom isn't about praying harder for provision. It's about **participating in God's economy of abundance through sharing.**\n\nIt's choosing mutual aid over hoarding. It's circulating your abundance instead of stockpiling it. It's trusting that when you share what you have, God provides what you need.\n\nThat's not reckless. That's faith.\n\nThe systems will keep failing. The economy will keep fracturing. But you'll have what you need.\n\nBecause **sharing is how needs get met in the kingdom.**",
      "wordCount": 112
    },
    {
      "number": 7,
      "heading": "THE SENDING",
      "type": "prayer",
      "content": "God,\n\nI started this week hoarding out of fear. I'm ending it with open hands.\n\nYou've shown me a different economy. Not the world's economy of scarcity and accumulation. But Your kingdom economy of trust and sharing.\n\nFive loaves fed thousands. A widow's oil never ran out. Manna appeared daily.\n\nWhen I share what I have, You provide what I need.\n\nThe systems are still failing. But I'm not alone. I have a community that shares. And we'll make it through together.\n\nSend me out with open hands. Teach me to circulate abundance, not hoard it.\n\nProvision isn't about having enough. It's about sharing what I have.\n\nI believe You now. Send me out.\n\nAmen.",
      "wordCount": 120
    }
  ],
  "totalWords": 660,
  "jesusIntroduced": 5,
  "scriptureReference": "Matthew 6:33, Matthew 10:9-10, Acts 2:44-45",
  "chiastic_position": "A' - Resolution/Sending (Echoes Day 1)"
}
