{
  "day": 5,
  "title": "Truth is a person, not a dataset—and he's waiting for you",
  "teaser": "The resolution: You were never meant to navigate the fog alone. Truth has a name. And he knows yours.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE LONELINESS OF SOLO VERIFICATION",
      "type": "text",
      "content": "You've been carrying the weight of truth alone.\n\nEvery claim to verify. Every source to evaluate. Every narrative to dissect. You're the sole arbiter of reality in your own life, and it's crushing you.\n\nBecause you were never meant to do this alone.\n\nHumanity has always needed shared truth—not imposed by power, but rooted in something real. Something that doesn't shift with politics or profits or propaganda.\n\nYou're exhausted because you've been trying to be your own anchor in a storm.\n\nBut what if the anchor already exists? What if you're not alone in this fog?\n\nWhat if truth has been pursuing you all along?",
      "wordCount": 105
    },
    {
      "number": 3,
      "heading": "TRUTH ISN'T NEUTRAL",
      "type": "text",
      "content": "Here's something uncomfortable:\n\n**Truth isn't just information. It's personal.**\n\nWhen Jesus said, \"I am the truth,\" he wasn't offering a neutral fact for you to evaluate. He was offering himself.\n\nA relationship. A commitment. A life reoriented around him.\n\nThat's why so many people walked away. Because you can fact-check information. But you can't fact-check a person without encountering them.\n\nAnd encountering Jesus means letting him reshape how you see everything.\n\nYour politics. Your certainties. Your tribal loyalties. Your need to be right.\n\nTruth isn't just about knowing facts. It's about being transformed by the one who is Truth.\n\nThat's scarier. And infinitely more freeing.",
      "wordCount": 106
    },
    {
      "number": 4,
      "heading": "THE COST AND THE GIFT",
      "type": "text-with-image",
      "content": "Choosing Jesus as your foundation for truth costs something.\n\nIt costs your illusion of control. Your certainty that you can verify your way to safety. Your tribal identity that depends on having the \"right\" information.\n\nBut here's what you gain:\n\n**Freedom from the exhaustion of endless verification.**\n**Peace in the middle of the information war.**\n**A foundation that doesn't collapse when the narrative shifts.**\n\nJesus said: **\"You will know the truth, and the truth will set you free.\"**\n\nNot imprison you in more rules. Not burden you with more information. **Free you.**\n\nFree from the paralysis of doubt. Free from the tyranny of misinformation. Free from the loneliness of navigating reality alone.\n\nBecause truth isn't a dataset you download. It's a person who knows you. And loves you anyway.",
      "illustration": {
        "description": "Dithered image of chains breaking, or person stepping from fog into light with arms outstretched",
        "file": "truth-day-5-illustration.png"
      },
      "wordCount": 132
    },
    {
      "number": 5,
      "heading": "TRUTH KNOWS YOUR NAME",
      "type": "text",
      "content": "Here's the most scandalous part:\n\nWhile you've been searching for truth, **truth has been searching for you.**\n\nJesus didn't wait for you to verify all the facts before he gave his life for you. He didn't require you to fact-check your way to certainty before he called you by name.\n\nHe knows you. Fully. Completely. And he doesn't turn away.\n\nThat's the difference between truth as information and truth as a person.\n\nInformation is something you master. But a person? A person knows you.\n\nAnd being known—really known—by someone who is Truth itself?\n\nThat's not just certainty. That's home.",
      "wordCount": 98
    },
    {
      "number": 6,
      "heading": "SEEK FIRST THE KINGDOM",
      "type": "text",
      "content": "This is where it all comes together:\n\n**\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nYou've been seeking truth in all the wrong places. Chasing facts. Verifying sources. Exhausting yourself with information that never satisfies.\n\nBut Jesus says: **Seek the kingdom first.**\n\nThe kingdom is where truth reigns. Where reality is anchored in the one who doesn't lie. Where you're known, loved, and free.\n\nWhen you seek that kingdom—when you build your life on Jesus, the Truth—everything else finds its place.\n\nNot because you have all the answers. But because you know the one who is the Answer.\n\nAnd that changes everything.",
      "wordCount": 110
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "Jesus,\n\nI've been searching for truth in datasets, headlines, and endless verification. I'm exhausted.\n\nBut You say You ARE the truth. Not information to master—a person to know.\n\nI'm done navigating this fog alone. I'm done carrying the weight of verification by myself.\n\nI want to know You. To be known by You. To build my life on the foundation that doesn't shift.\n\nBe my anchor. My truth. My home.\n\nAmen.",
      "wordCount": 73
    }
  ],
  "totalWords": 624,
  "jesusIntroduced": 3,
  "scriptureReference": "John 14:6, John 8:32, Matthew 6:33",
  "chiastic_position": "A' - Resolution (Mirroring Day 1)"
}
