{
  "day": 3,
  "title": "What if truth isn't a fact you verify—it's a person you know?",
  "teaser": "The pivot: Truth isn't information. It's incarnation. You're not looking for better data—you're looking for someone who doesn't lie.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE INFORMATION TRAP",
      "type": "text",
      "content": "You've been treating truth like a treasure hunt.\n\nIf you just read the right articles, analyze the right sources, fact-check the right claims—eventually, you'll find it. The truth will emerge from the data.\n\nBut here's the problem: **More information hasn't made you more certain. It's made you more confused.**\n\nBecause truth isn't something you extract from competing narratives. It's not a conclusion you reach after enough research.\n\nYou've been searching for truth in the wrong place.\n\nYou're trying to know your way to certainty. But what you need isn't more knowledge.\n\nYou need to be known.",
      "wordCount": 98
    },
    {
      "number": 3,
      "heading": "THE COST OF INFORMATION OVERLOAD",
      "type": "text",
      "content": "Here's what information overload does to you:\n\nIt convinces you that truth is always one more article away. One more podcast. One more study. One more expert opinion.\n\nSo you keep consuming. Scrolling. Searching. Trying to know enough to be certain.\n\nBut the more you learn, the more you realize how much you don't know. The more sources you consult, the more contradictions you find.\n\nYou're chasing a ghost.\n\nBecause **truth isn't a dataset you can master. It's a foundation you stand on.**\n\nAnd you can't stand on information. It shifts too quickly.",
      "wordCount": 96
    },
    {
      "number": 4,
      "heading": "THE BREAKING POINT",
      "type": "text-with-image",
      "content": "You're at the breaking point.\n\nYou've fact-checked yourself into exhaustion. You've questioned everything until nothing feels solid. You've consumed so much information that you can't think straight anymore.\n\nAnd in the middle of the noise, you hear a question you didn't expect:\n\n**What if you're asking the wrong question?**\n\nYou've been asking, \"What is true?\" But maybe the real question is, \"Who is true?\"\n\nBecause facts can be manipulated. Data can be spun. Information can be weaponized.\n\nBut a person—someone whose very nature is truth—doesn't shift with the algorithm.\n\nMaybe you don't need better information. Maybe you need a relationship with someone who can't lie.",
      "illustration": {
        "description": "Dithered image of person stepping out of fog/static into clarity, or light breaking through fractured screens",
        "file": "truth-day-3-illustration.png"
      },
      "wordCount": 121
    },
    {
      "number": 5,
      "heading": "THE PIVOT — \"I AM THE TRUTH\"",
      "type": "text",
      "content": "Jesus said something that sounds absurd in our fact-checking culture:\n\n**\"I am the way, and the truth, and the life.\"**\n\nNot \"I have the truth.\" Not \"I teach the truth.\" I AM the truth.\n\nThis is scandalous. Because it means truth isn't something you verify. It's someone you encounter.\n\nYou can't fact-check a person into trustworthiness. You know them. You walk with them. You see if their words match their actions.\n\nAnd Jesus? His words matched his life. Perfectly.\n\nHe said, \"Love your enemies.\" Then he forgave the people who crucified him.\n\nHe said, \"The truth will set you free.\" Then he freed people from shame, fear, and death itself.\n\n**His life was the proof. Not a claim to verify—a reality to encounter.**",
      "wordCount": 121
    },
    {
      "number": 6,
      "heading": "THE KINGDOM REVERSAL",
      "type": "text",
      "content": "This is the core revelation of the kingdom:\n\n**Truth isn't information you master. It's a person you trust.**\n\nJesus says, \"Seek first the kingdom.\"\n\nThe kingdom isn't a place where you finally have enough data to be certain. It's a place where **you know the one who is certain—and that's enough.**\n\nYou stop trying to verify everything on your own. You stop exhausting yourself with endless fact-checking. You stop living in the fog of distrust.\n\nBecause you know someone who doesn't lie. Someone who doesn't manipulate. Someone whose very nature is truth.\n\nAnd when you know him, you have a foundation that doesn't collapse.\n\nNot because you've figured everything out. Because you trust the one who has.",
      "wordCount": 116
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "Jesus,\n\nI've been searching for truth in all the wrong places. Trying to verify my way to certainty. Exhausting myself with information that never satisfies.\n\nBut You say You ARE the truth. Not a fact to verify—a person to know.\n\nI'm tired of the fog. Teach me to trust You. Not because I have all the answers, but because You are the answer.\n\nBe my foundation when everything else shifts.\n\nAmen.",
      "wordCount": 72
    }
  ],
  "totalWords": 624,
  "jesusIntroduced": 5,
  "scriptureReference": "John 14:6, Matthew 6:33",
  "chiastic_position": "C - THE PIVOT (Core Revelation)"
}
