{
  "day": 4,
  "title": "From information overload to wisdom: learning to discern",
  "teaser": "You don't need more facts. You need the wisdom to know what's true—and Who to trust.",
  "framework": "Matthew 6:33 - Seek first the kingdom... and all these things will be added",
  "panels": [
    {
      "number": 1,
      "type": "cover",
      "content": "WAKE UP",
      "image": "wU1.png"
    },
    {
      "number": 2,
      "heading": "THE DIFFERENCE BETWEEN KNOWLEDGE AND WISDOM",
      "type": "text",
      "content": "You have access to more information than any generation in history.\n\nBut information isn't wisdom.\n\n**Information is knowing that tomatoes are a fruit. Wisdom is not putting them in a fruit salad.**\n\nYou can have endless facts and still make terrible decisions. You can consume all the data and still live in confusion.\n\nBecause wisdom isn't about how much you know. It's about **knowing what matters.**\n\nAnd in a world drowning in misinformation, what you need isn't more information. It's the discernment to tell the difference between noise and truth.\n\nThat's wisdom. And you can't Google your way to it.",
      "wordCount": 105
    },
    {
      "number": 3,
      "heading": "WHAT WISDOM LOOKS LIKE",
      "type": "text",
      "content": "Wisdom doesn't mean you have all the answers. It means you know where to look for them.\n\nWisdom doesn't mean you never doubt. It means you don't let doubt paralyze you.\n\nWisdom doesn't mean you trust everything. It means **you know who to trust.**\n\nThe ancient Proverbs say:\n\n**\"Trust in the Lord with all your heart and lean not on your own understanding.\"**\n\nThis isn't anti-intellectual. It's anti-arrogance.\n\nBecause the alternative to trusting God isn't trusting facts. It's trusting yourself. And your own understanding is limited, biased, and easily manipulated.\n\nWisdom is recognizing that. And choosing a better foundation.",
      "wordCount": 102
    },
    {
      "number": 4,
      "heading": "DISCERNMENT AS A SPIRITUAL PRACTICE",
      "type": "text-with-image",
      "content": "So how do you develop discernment in a world of deepfakes and propaganda?\n\nNot by consuming more information. By cultivating a relationship with the one who is Truth.\n\nHere's what that looks like practically:\n\n**1. Start with Scripture.** Not as a fact-checking manual, but as a foundation. When you know Jesus—his character, his values, his way—you can recognize what contradicts him.\n\n**2. Ask better questions.** Not just \"Is this true?\" but \"Does this align with the kingdom? Does this reflect Jesus' character? Does this lead to love or division?\"\n\n**3. Slow down.** Misinformation thrives on speed. Wisdom requires pause. Before you share, before you react, before you believe—stop. Breathe. Pray.\n\n**4. Trust the Spirit.** Jesus promised his Spirit would \"guide you into all truth.\" Not all facts. Truth. That's bigger.",
      "illustration": {
        "description": "Dithered image of person with roots growing deep, or light cutting through darkness like a sword",
        "file": "truth-day-4-illustration.png"
      },
      "wordCount": 146
    },
    {
      "number": 5,
      "heading": "WISDOM OVER INFORMATION",
      "type": "text",
      "content": "Jesus said:\n\n**\"Everyone who hears these words of mine and puts them into practice is like a wise man who built his house on the rock.\"**\n\nNot \"everyone who memorizes my teachings.\" Not \"everyone who fact-checks my claims.\"\n\nEveryone who **practices.**\n\nBecause wisdom isn't theoretical. It's lived.\n\nYou don't become discerning by consuming more content. You become discerning by **walking with Jesus and learning to see the world through his eyes.**\n\nThat's the difference between information and wisdom.\n\nInformation tells you what's happening. Wisdom tells you what matters.\n\nAnd in a world of noise, knowing what matters changes everything.",
      "wordCount": 101
    },
    {
      "number": 6,
      "heading": "SEEK FIRST THE KINGDOM",
      "type": "text",
      "content": "This is where Matthew 6:33 becomes your anchor:\n\n**\"Seek first the kingdom of God and his righteousness, and all these things will be added to you.\"**\n\nYou've been seeking truth in headlines, in fact-checkers, in endless research. But Jesus says: **Seek the kingdom first.**\n\nThe kingdom is where truth reigns. Not spin. Not propaganda. Not partisan manipulation. Truth.\n\nAnd when you seek that kingdom—when you orient your life around Jesus and his way—discernment follows.\n\nYou stop being tossed around by every new claim. You stop exhausting yourself with verification. You have a foundation.\n\nNot because you know everything. Because you know the one who does.\n\nAnd that's enough.",
      "wordCount": 107
    },
    {
      "number": 7,
      "heading": "THE INVITATION",
      "type": "prayer",
      "content": "God,\n\nI'm drowning in information, but I'm starving for wisdom.\n\nTeach me to discern. Not by consuming more content, but by knowing You. By walking with Jesus. By listening to Your Spirit.\n\nWhen I'm overwhelmed by conflicting claims, remind me: I don't need to know everything. I need to know You.\n\nAnd when I know You, I have a foundation that doesn't shift.\n\nAmen.",
      "wordCount": 66
    }
  ],
  "totalWords": 627,
  "jesusIntroduced": 5,
  "scriptureReference": "Proverbs 3:5-6, Matthew 7:24, Matthew 6:33, John 16:13",
  "chiastic_position": "B' - Application (Mirroring Day 2)"
}
